erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСкладСырье/СХК_МобильныйСкладСырье.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_МобильныйСкладСырье</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабПриемка</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСобрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c0a070a8-fff5-49fe-8c9e-3fbae30394cb">
    <name>НалоговыйАгентПоНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e8352fa6-99c0-4f4b-9227-b1ac7d158a3e">
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

erpdev.СХК_Расширение/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>СиламиПеревозчикаПоАдресу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ДоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КПолучателюОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПоставщикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НашимиСиламиСАдресаОтправителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоПунктаПередачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтОтправителяОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

erpdev.СХК_Расширение/src/Enums/ПорядокРасчетов/ПорядокРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9b333cc3-56b6-4b71-8111-6ac5626fa947">
  <name>ПорядокРасчетов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="21eeb128-c7c8-4670-a06f-a0e920da31af">
    <name>ПоНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="27ca6d68-e67a-4889-9637-02a127ea6bb7">
    <name>ПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4f954f84-d9f9-4d34-8b96-cd90db36a2c4">
    <name>ПоДоговорамНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="68be4e2f-917b-4f18-80e2-5f8f3c83a252">
    <name>ПоЗаказамНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="351f3b97-ac90-4e79-9d41-cdc11138aa2f">
    <name>ПоДоговорамКонтрагентов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

erpdev.СХК_Расширение/src/Documents/ПриходныйОрдерНаТовары/ПриходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6a90e124-5af0-4a37-8ff7-14481b8cb2dd">
  <name>ПриходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="5dcdee8c-9444-4bd3-ae94-e55f618ed216">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a3dfe1b-75d0-4247-8d64-84bab203cf9c">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbce78e7-d91d-4dac-8a0c-b47e64d9325b">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cd3d95f-95cb-4f59-909e-802e5579ac5b">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8762c46f-68da-4109-a1f4-fb201e69cf69">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f481b21a-9531-4e52-9957-c494f5e377f6">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c0f355e-967b-4aef-9cf3-b95cc9fdfcef">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0368be3-8269-42f8-b1e8-5a902ab8fbd0">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95326fc6-5780-440a-84af-cd29440e2b58">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ca8589c8-0a63-4506-aa59-5684f62c08c1">
    <name>ЗонаПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a679cf3-b805-4f49-bee6-d93a2702e946">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b49b6320-3833-4d7e-9256-844ccbfa090e">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06e8c720-eb9f-425a-9716-baef1a36e9a3">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0cdca97b-7d3f-41b0-a49d-95b6449dd7ac">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="efa8b93c-791b-4449-99fd-217a3baf3df6">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="4c33a3ea-7a9b-4d40-8f7d-a7581e73da16">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="91453e18-03ae-4724-8a0e-3401542ee57a">
      <name>ДокументОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75e84f0f-f847-4153-b485-7a92a831f94b">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dfa19489-ad65-49e8-bcaa-38abf251ab1a">
      <name>УпаковочныйЛистРодитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="193cb4c0-81db-49ab-a130-d34f2a776519">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eeb10de4-4d97-4473-b2ac-e752ff3ab390">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9dd9c28c-0ab6-479c-907f-118c9feac29e">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fa78140c-0253-4803-87da-cf38870a1ab3">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8496f61d-538d-4d21-80c3-b273a1617696">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="55fb4905-a811-46e2-9192-771e2fb958cc">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75fac7f0-d3fd-4458-a727-7598962ea772">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1f572790-edb3-4f4d-b716-aac43eeb7c85">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f4b9edd5-b41d-4b6b-86c5-b4d3896e8b32">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="608ab205-e85c-4c0c-bb0a-19c0fcca2cd5">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСкладСырье/Forms/ФормаПоступления/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);


	Если ЗначениеЗаполнено(СтруктураПараметров.ЗаказПоставщику)  Тогда
		ЭтотОбъект.ДокументЗаказПоставщику = СтруктураПараметров.ЗаказПоставщику;
		ЗаполнитьФорму(СтруктураПараметров.СтрокиЗаказПоставщику);	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорму(МасТоваров)
	
	Товары.Очистить();
	
	Для сч=0 по МасТоваров.Количество()-1 Цикл
		строкаТоваров = МасТовары.Добавить();
		СтрокаТоваров.Номенклатура = МасТоваров[сч].Номенклатура;
		СтрокаТоваров.КоличествоУпаковок = МасТоваров[сч].КоличествоУпаковок;
	КонецЦикла;	
	
	//МасТовары.Загрузить(Товары.Выгрузить());
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьПриходныйОрдер(Заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
	               |ГДЕ
	               |	ПриходныйОрдерНаТовары.ПометкаУдаления = ЛОЖЬ
	               //|	И ПриходныйОрдерНаТовары.Проведен = ЛОЖЬ
	               |	И ТИПЗНАЧЕНИЯ(ПриходныйОрдерНаТовары.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	               |	И ПриходныйОрдерНаТовары.Распоряжение = &Ссылка
	               |	И ПриходныйОрдерНаТовары.НомерВходящегоДокумента = &НомерВходящегоДокумента";
	Запрос.УстановитьПараметр("Ссылка",Заказ.Ссылка );
	Запрос.УстановитьПараметр("НомерВходящегоДокумента",ЭтотОбъект.НомерУПД );
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ПроверитьУПД() Тогда
		ОткрытьФормуУПД(); 
	Иначе
		ПроверитьСоздатьДокументПО();
		ОбработатьТабЧасть("");
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПроверитьУПД()

	Если ЗначениеЗаполнено(ЭтаФорма.НомерУПД) И ЗначениеЗаполнено(ЭтаФорма.ДатаУПД) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции



&НаКлиенте
Процедура ОткрытьФормуУПД()
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыОстатки = Новый Структура;
	ПараметрыФормыОстатки.Вставить("ЗаказПоставщику",ДокументЗаказПоставщику);
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыФормаУПД", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаУПД", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыФормаУПД(Значение, ДопПараметры) Экспорт

	Если ЗначениеЗаполнено(Значение) Тогда  
		Если Значение.НомерУПД <> 0 Тогда
			ЭтотОбъект.ДатаУПД = Значение.ДатаУПД;  
			ЭтотОбъект.НомерУПД = Значение.НомерУПД; 
			ПроверитьСоздатьДокументПО();
			ОбработатьТабЧасть("");
		Иначе
			ОткрытьФормуВопроса();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВопроса()
	Ответ = Вопрос("Ввести номер УПД?",//"Ордер собран",//"Разместить ордер ?",
	РежимДиалогаВопрос.ДаНетОтмена,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Ввести номер УПД?" // (необ.) заголовок
	//"По данному ордеру все собрано !!!"
	);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОткрытьФормуУПД();
	Иначе
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
 	СтандартнаяОбработка = Ложь;  
	Если Не ПроверитьУПД() Тогда
		ОткрытьФормуУПД(); 
	Иначе
		Если Элемент.ТекущиеДанные.КоличествоПринято > 0 И Элемент.ТекущиеДанные.Принято = Ложь Тогда
			ВывестиВопрос(Элемент.ТекущиеДанные);	
		ИначеЕсли Элемент.ТекущиеДанные.Принято = Истина Тогда
			ВывестиВопросИзменения(Элемент.ТекущиеДанные);	
		Иначе
			ПараметрыФормыОстатки = Новый Структура;
			ПараметрыФормыОстатки.Вставить("ДокументПО",ЭтотОбъект.ДокументПО);
			СтруктураСтрока = Новый Структура("Номенклатура,КоличествоУпаковок,СерияНоменклатуры,КоличествоПринято,Принято,Упаковка,НомерСтрокиДокумента");
			ЗаполнитьЗначенияСвойств(СтруктураСтрока, Элемент.ТекущиеДанные);	 
			ПараметрыФормыОстатки.Вставить("СтрокаЗаказПоставщику",СтруктураСтрока);
			АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
			_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
			//@skip-check notify-description-to-server-procedure
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
			ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаСборкиПоступления", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли; 
	КонецЕсли;
	
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте 
Процедура ВывестиВопросИзменения(Данные)

	Ответ = Вопрос("Изменить позицию?",
	РежимДиалогаВопрос.ДаНет,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Изменить позицию?" // (необ.) заголовок
	);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ДокументПО",ЭтотОбъект.ДокументПО);
		СтруктураСтрока = Новый Структура("Номенклатура,КоличествоУпаковок,СерияНоменклатуры,КоличествоПринято,Принято,Упаковка,НомерСтрокиДокумента");
		ЗаполнитьЗначенияСвойств(СтруктураСтрока, Данные);	 
		ПараметрыФормыОстатки.Вставить("СтрокаЗаказПоставщику",СтруктураСтрока);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщикаИзменение", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаСборкиПоступления", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
	
КонецПроцедуры



&НаКлиенте 
Процедура ВывестиВопрос(Данные)

	Ответ = Вопрос("Добавить позицию?",
	РежимДиалогаВопрос.ДаНет,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Добавить позицию?" // (необ.) заголовок
	);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ДокументПО",ЭтотОбъект.ДокументПО);
		СтруктураСтрока = Новый Структура("Номенклатура,КоличествоУпаковок,СерияНоменклатуры,КоличествоПринято,Принято,Упаковка,НомерСтрокиДокумента");  
		ЗаполнитьЗначенияСвойств(СтруктураСтрока, Данные);
		СтруктураСтрока.Вставить("СерияНоменклатуры","");
		//СтруктураСтрока.Вставить("КоличествоПринято",0);
		ПараметрыФормыОстатки.Вставить("СтрокаЗаказПоставщику",СтруктураСтрока);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаСборкиПоступления", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗаказПоставщикаИзменение(Значение, ДопПараметры) Экспорт 
	Если ЗначениеЗаполнено(Значение) Тогда 
		//ИзменитьТабЧасть(Значение);
		ПроверитьСоздатьДокументПО();
		ОбработатьТабЧасть("");
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ИзменитьТабЧасть(Структура)
	
	Если ЗначениеЗаполнено(Структура) Тогда  
		
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",Структура.Номенклатура);
			Отбор.Вставить("Принято",Истина);
			Отбор.Вставить("СерияНоменклатуры",Структура.СерииНоменклатуры);
			Строки = Товары.НайтиСтроки(Отбор); 
			Если Строки.Количество()>=1 Тогда
				СтрокаИзм = Строки[0];
			КонецЕсли;
				
			ОтборН = Новый Структура;
			ОтборН.Вставить("Номенклатура",Структура.Номенклатура);
			ОтборН.Вставить("Принято",Ложь);
			СтрокиОтбор = Товары.НайтиСтроки(ОтборН);

			Если СтрокиОтбор.Количество()>=1 Тогда
				СтрокиРод = СтрокиОтбор[0];
			КонецЕсли;
			
			Если Структура.КоличествоУпаковокПринято = 0 Тогда
				СтрокиРод.КоличествоПринято = СтрокиРод.КоличествоПринято - СтрокаИзм.КоличествоПринято;
				Товары.Удалить(СтрокаИзм);
			ИначеЕсли Структура.КоличествоУпаковокПринято > 0 Тогда   
				СтрокиРод.КоличествоПринято = СтрокиРод.КоличествоПринято - СтрокаИзм.КоличествоПринято+Структура.КоличествоУпаковокПринято;
				СтрокаИзм.КоличествоПринято	= Структура.КоличествоУпаковокПринято;
				СтрокаИзм.НомерСтрокиДокумента	= Структура.НомерСтрокиДокумента;
			КонецЕсли;
 
		Товары.Сортировать("Принято Возр");
	КонецЕсли;
	
КонецПроцедуры




&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗаказПоставщика(Значение, ДопПараметры) Экспорт 
	Если ЗначениеЗаполнено(Значение) Тогда 
		//ОбработатьТабЧасть(Значение);
		ПроверитьСоздатьДокументПО();
		ОбработатьТабЧасть("");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоздатьДокументПО() 
	Товары.Очистить();
	Товары.Загрузить(МасТовары.Выгрузить());
	ДокПО = ПолучитьПриходныйОрдер(ЭтотОбъект.ДокументЗаказПоставщику);
	Если ДокПО = Ложь Тогда
		НовыйДокПо = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
		НовыйДокПо.Дата = ТекущаяДата();  
		НовыйДокПо.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
		НовыйДокПо.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаОтПоставщика;    
		НовыйДокПо.Склад = ЭтотОбъект.ДокументЗаказПоставщику.Склад;
		НовыйДокПо.Отправитель = ЭтотОбъект.ДокументЗаказПоставщику.Партнер;
		НовыйДокПо.НомерВходящегоДокумента = ЭтотОбъект.НомерУПД;
		НовыйДокПо.ДатаВходящегоДокумента = ЭтотОбъект.ДатаУПД;
		НовыйДокПо.Распоряжение = ЭтотОбъект.ДокументЗаказПоставщику.Ссылка;
		НовыйДокПо.Ответственный = Пользователи.АвторизованныйПользователь();
		НовыйДокПо.Записать(РежимЗаписиДокумента.Запись); 
		ЭтотОбъект.ДокументПО = НовыйДокПо.Ссылка;
	Иначе
		ЭтотОбъект.ДокументПО = ДокПО.Ссылка;  
		
		Для Каждого стр из ДокПО.Ссылка.Товары Цикл
			СЗ = Новый Структура;
			СЗ.Вставить("Номенклатура",стр.Номенклатура);
			СЗ.Вставить("КоличествоУпаковокПринято",стр.Количество);
			СЗ.Вставить("СерииНоменклатуры",стр.Серия);   
			СЗ.Вставить("Упаковка",стр.Упаковка);
			СЗ.Вставить("НомерСтрокиДокумента",стр.НомерСтроки);
		    ОбработатьТабЧасть(СЗ);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьТабЧасть(Структура)
	
	Если ЗначениеЗаполнено(Структура) Тогда  
		Если Структура.КоличествоУпаковокПринято > 0 Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",Структура.Номенклатура);
			Отбор.Вставить("Принято",Ложь);
			
			Строки = Товары.НайтиСтроки(Отбор);
			
			Если Строки.Количество()>=1 Тогда
				Строки[0].КоличествоПринято = Строки[0].КоличествоПринято + Структура.КоличествоУпаковокПринято; 
				Строки[0].КоличествоУпаковок = Строки[0].КоличествоУпаковок - Строки[0].КоличествоПринято; 
				
				Т = Товары.Добавить();
				Т.Номенклатура = Структура.Номенклатура;				
				Т.НомерСтрокиДокумента = Структура.НомерСтрокиДокумента;				
				Т.КоличествоПринято = Структура.КоличествоУпаковокПринято;				
				Т.СерияНоменклатуры = Структура.СерииНоменклатуры;				
				Т.Упаковка = Структура.Упаковка;	
				Т.Принято = Истина;	
				Если Строки[0].КоличествоУпаковок <=0 Тогда				
				//Если Строки[0].КоличествоПринято >= Строки[0].КоличествоУпаковок Тогда 
					Товары.Удалить(Строки[0]);
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли; 
		Товары.Сортировать("Принято Возр");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)
	Ответ = Вопрос("Завершить прием сырья?",
	РежимДиалогаВопрос.ДаНет,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Завершить прием сырья?" // (необ.) заголовок
	);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Ош = ПринятьНаСервере();
		Если Ош = Ложь Тогда
			ЭтаФорма.Закрыть();
		Иначе
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
			ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");
		КонецЕсли;
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеСохранения(Значение) Экспорт 
					
КонецПроцедуры

&НаСервере
Функция ПринятьНаСервере() 
	
	Ош = Истина;
	
	Таб = ДокументПО.Товары.Выгрузить();  

		Заказ = ЭтотОбъект.ДокументЗаказПоставщику.ПолучитьОбъект();
		ТабЗаказаЗП = Заказ.Товары.Выгрузить();
		
		ТабДокПТУ = Таб.Скопировать();
		ТабДокПТУ.Свернуть("Номенклатура","КоличествоУпаковок");
		Для каждого стрПТУ из ТабДокПТУ Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", стрПТУ.Номенклатура);
			Строки = ТабЗаказаЗП.НайтиСтроки(Отбор);
			Если Строки.Количество()>=1 Тогда
				Если Строки[0].КоличествоУпаковок <> стрПТУ.КоличествоУпаковок Тогда
					Строки[0].КоличествоУпаковок = стрПТУ.КоличествоУпаковок;
					Строки[0].Количество = стрПТУ.КоличествоУпаковок;
					
				СтруктураПересчетаСуммы = Новый Структура;

				Если Строки[0].СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС Тогда
					СтруктураПересчетаСуммы.Вставить("НалогообложениеНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
					СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Истина);
				Иначе
					СтруктураПересчетаСуммы.Вставить("НалогообложениеНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС);
					СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Ложь);
					
				КонецЕсли;
					
					
				СтруктураДействий = Новый Структура;  
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСумму");
				СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));

				ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Строки[0], СтруктураДействий, Неопределено);
					
				КонецЕсли;
			КонецЕсли;
		конецЦикла;
		
		Попытка 
			Заказ.Товары.Загрузить(ТабЗаказаЗП);
			Заказ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение   
			Заказ.Записать(РежимЗаписиДокумента.Запись);
			Ош = "При проведении возникла ошибка, проведите в ручную";
		КонецПопытки;
	
	
	ТабЗаказа = ЭтотОбъект.ДокументЗаказПоставщику.Товары.Выгрузить();
	
	Док = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент(); 
	Док.Дата = ТекущаяДата(); 
	Док.ДатаПоступления = ТекущаяДата();
	Док.Партнер = ЭтотОбъект.ДокументЗаказПоставщику.Партнер.Ссылка;
	Док.Контрагент = ЭтотОбъект.ДокументЗаказПоставщику.Контрагент.Ссылка;
	Док.Организация = ЭтотОбъект.ДокументЗаказПоставщику.Организация;
	Док.Договор = ЭтотОбъект.ДокументЗаказПоставщику.Договор;
	Док.ЗаказПоставщику = ЭтотОбъект.ДокументЗаказПоставщику.Ссылка;
	Док.ВалютаВзаиморасчетов = ЭтотОбъект.ДокументЗаказПоставщику.Валюта;
	Док.Валюта =  ЭтотОбъект.ДокументЗаказПоставщику.Валюта; 
	Док.ЦенаВключаетНДС = ЭтотОбъект.ДокументЗаказПоставщику.ЦенаВключаетНДС;
	Док.ПоступлениеПоЗаказам = Истина;
	Док.Склад = ЭтотОбъект.ДокументЗаказПоставщику.Склад; 
	Док.Подразделение = ЭтотОбъект.ДокументЗаказПоставщику.Подразделение;
	Док.Соглашение = ЭтотОбъект.ДокументЗаказПоставщику.Соглашение;
	Док.ХозяйственнаяОперация = ЭтотОбъект.ДокументЗаказПоставщику.ХозяйственнаяОперация;
	Док.ГруппаФинансовогоУчета = ЭтотОбъект.ДокументЗаказПоставщику.ГруппаФинансовогоУчета;
	Док.Автор = Пользователи.АвторизованныйПользователь();
	Док.ЗакупкаПодДеятельность = ЭтотОбъект.ДокументЗаказПоставщику.ЗакупкаПодДеятельность;
	Док.НалогообложениеНДС = ЭтотОбъект.ДокументЗаказПоставщику.НалогообложениеНДС;;
	Док.ВариантПриемкиТоваров   = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	Док.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;   
	
	Док.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам;
	Док.НомерВходящегоДокумента = ЭтотОбъект.НомерУПД;
	Док.ДатаВходящегоДокумента = ЭтотОбъект.ДатаУПД; 
	
	
	Для Каждого стр из Таб Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",стр.Номенклатура);
		Строки = ТабЗаказа.НайтиСтроки(Отбор);
		
		Если Строки.Количество()>=1 Тогда 
		
				Т = Док.Товары.Добавить();  
				Т.кодСтроки = Строки[0].кодСтроки;
				Т.Номенклатура = стр.Номенклатура;
				Т.Упаковка = стр.Упаковка;
				Т.КоличествоУпаковок = стр.КоличествоУпаковок;
				Т.Количество = стр.Количество; 
				Т.Цена = Строки[0].Цена;
				Т.СтавкаНДС = Строки[0].СтавкаНДС;
				Т.Склад = ЭтотОбъект.ДокументЗаказПоставщику.Склад ;
				Т.ЗаказПоставщику = ЭтотОбъект.ДокументЗаказПоставщику.Ссылка;
				Т.ОбъектРасчетов  = ЭтотОбъект.ДокументЗаказПоставщику.Ссылка;
				Если стр.Серия <> Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
					Т.Серия = стр.Серия;
					Т.СтатусУказанияСерий = 14;
				Иначе
					Т.СтатусУказанияСерий = 0;
				КонецЕсли;  
				
				СтруктураПересчетаСуммы = Новый Структура;
				
				Если Строки[0].СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС Тогда
					СтруктураПересчетаСуммы.Вставить("НалогообложениеНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
					СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Истина);
				Иначе
					СтруктураПересчетаСуммы.Вставить("НалогообложениеНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС);
					СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Ложь);
					
				КонецЕсли;
				
				
				СтруктураДействий = Новый Структура;  
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
				
				СтруктураДействий.Вставить("ПересчитатьСумму");
				СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
				СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
				ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Т, СтруктураДействий, Неопределено);
					
		Иначе
			Ош = "Товар отсутствует в заказе";
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	Попытка	
		
		
					
		Док.Записать(РежимЗаписиДокумента.Проведение);  
		ДокПо = ДокументПО.ПолучитьОбъект();
		докПо.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят;
		докПо.Записать(РежимЗаписиДокумента.Проведение);
		Ош = Ложь;
		
	Исключение 
		Док.Записать(РежимЗаписиДокумента.Запись);
		Ош = "При проведении возникла ошибка, проведите в ручную";
	КонецПопытки;		
	
	
	
	Возврат  Ош;
	
КонецФункции
